Repository: NMarjou/localization-app
Catalog: TMs/en-US_nl-NL.tmx
Source language: en_us
Languages: nl_nl

source: Reminder details
nl_nl: Details van de herinnering

source: Are you sure you want to delete this reminder?<br/>This will permanently remove all configurations.
nl_nl: Weet u zeker dat u deze herinnering wilt verwijderen?<br/>Hiermee verwijdert u alle configuraties permanent.

source: Delete round reminder
nl_nl: Herinnering voor ronde verwijderen

source: The round reminder was successfully deleted.
nl_nl: De rondeherinnering is succesvol verwijderd.

source: Open reminder
nl_nl: Open herinnering

source: The round reminder was successfully duplicated.
nl_nl: De rondenherinnering is succesvol gedupliceerd.

source: Duplication done
nl_nl: Duplicatie voltooid

source: No round reminders yet.
nl_nl: Nog geen rondeherinneringen.

source: Send reminders to comp managers and comp managers +1.
nl_nl: Stuur herinneringen naar compmanagers en compmanagers +1.

source: Round reminders
nl_nl: Herinneringen voor ronde

source: Sent date
nl_nl: Verzenddatum

source: Criterion
nl_nl: Criterium

source: The criterion is required.
nl_nl: Het criterium is vereist.

source: Please add at least one block.
nl_nl: Voeg alstublieft ten minste één blok toe.

source: You haven't added any blocks.
nl_nl: U heeft nog geen blokken toegevoegd.

source: Add blocks to start configuring the rule conditions.
nl_nl: Voeg blokken toe om de regelvoorwaarden te configureren.

source: Add condition blocks to configure the rule
nl_nl: Voeg voorwaardeblokken toe om de regel te configureren

source: Rule exceptions
nl_nl: Uitzonderingen op regels

source: Include/exclude individuals for whom an exception to the rule is required.
nl_nl: Voeg personen toe of sluit ze uit voor wie een uitzondering op de regel nodig is.

source: No rules yet
nl_nl: Nog geen regels

source: The compensation round was successfully saved as pending draft.
nl_nl: De beloningsronde is succesvol opgeslagen als concept in behandeling.

source: Create and manage statement generation rules.
nl_nl: Maak en beheer regels voor het genereren van overzichten.

source: Statement generation
nl_nl: Genereren van overzichten

source: No comp rounds with round name or code "{{phrase}}"
nl_nl: Geen compensatierondes met de ronde naam of code "{{phrase}}"

source: Set target
nl_nl: Doel instellen

source: Are you sure you want to delete the target budget?
nl_nl: Weet je zeker dat je het doelbudget wilt verwijderen?

source: Delete target
nl_nl: Doel verwijderen

source: Target budget amount
nl_nl: Doelbudgetbedrag

source: Target budget
nl_nl: Doelbudget

source: Manage the target budget per compensation element
nl_nl: Beheer het doelbudget per compensatie-element

source: Set target budget
nl_nl: Stel doelbudget in

source: Last edited
nl_nl: Laatst bewerkt

source: Round
nl_nl: Ronde

source: The comp round code must be unique.
nl_nl: De comp-rondecode moet uniek zijn.

source: View compensation round
nl_nl: Compensatieronde bekijken

source: Access standard reports and create specific analyses linked to a comp round.
nl_nl: Toegang tot standaardrapporten en maak specifieke analyses gekoppeld aan een comp-ronde.

source: Budget & modeling
nl_nl: Budget & modellering

source: Create a budget based on your comp elements and your comp framework. Enable modeling on the population.
nl_nl: Maak een budget op basis van je comp-elementen en je comp-raamwerk. Schakel modellering in voor de populatie.

source: Coming soon
nl_nl: Binnenkort beschikbaar

source: Compensation Tree & Elements
nl_nl: Compensatieboom & Elementen

source: Compensation framework
nl_nl: Compensatiekader

source: FX management
nl_nl: FX-beheer

source: Enable currency and link rates to comp elements/rounds.
nl_nl: Schakel valuta in en koppel tarieven aan comp-elementen/rondes.

source: Comp rounds
nl_nl: Compensatierondes

source: Create comp round
nl_nl: Comp-ronde aanmaken

source: Create and manage a comp rounds based on a data core. Link specific comp elements and a budget.
nl_nl: Creëer en beheer compensatierondes op basis van een datakern. Koppel specifieke compensatie-elementen en een budget.

source: Simulations
nl_nl: Simulaties

source: Simulation outcomes based on the budget, comp and analytics.
nl_nl: Gesimuleerde uitkomsten op basis van het budget, de compensatie en de analyses.

source: Comp tree & elements
nl_nl: Compensatiestructuur & elementen

source: Create your organization's compensation framework and specific comp elements: salary, allowances, per diems, bonus, deferrals, equity and indirect benefits/allowances.
nl_nl: Creëer het compensatiekader van uw organisatie en specifieke comp-elementen: salaris, toelagen, dagvergoedingen, bonus, uitgestelde betalingen, aandelen en indirecte voordelen/toelagen.

source: Create competency scales
nl_nl: Creëer competentieschalen

source: Are you sure you want to delete this competency scale?
nl_nl: Weet je zeker dat je deze competentieschaal wilt verwijderen?

source: Delete competency scale
nl_nl: Verwijder competentieschaal

source: The selected scale is currently in use and cannot be deleted. Remove it from any active plans or processes before attempting to delete it again.
nl_nl: De geselecteerde schaal is momenteel in gebruik en kan niet worden verwijderd. Verwijder het uit alle actieve plannen of processen voordat u het opnieuw probeert te verwijderen.

source: The scale is active; it cannot be deleted.
nl_nl: De schaal is actief; deze kan niet worden verwijderd.

source: Create competency scale
nl_nl: Maak competentieschaal

source: Create skills & competency group
nl_nl: Maak vaardigheden- en competentiegroep aan

source: Group details
nl_nl: Groepsdetails

source: Add skills
nl_nl: Vaardigheden toevoegen

source: List of competencies for the scale
nl_nl: Lijst van competenties voor de schaal

source: Edit competency scale
nl_nl: Bewerk competentieschaal

source: Add competency
nl_nl: Competentie toevoegen

source: No competencies yet
nl_nl: Nog geen competenties

source: Competency scale
nl_nl: Competentieschaal

source: Get started by uploading one.
nl_nl: Begin door er een te uploaden.

source: No skills libraries yet!
nl_nl: Nog geen vaardigheidsbibliotheken!

source: No competency scales available. You can create scales in the "Competency scales" page of the Performance Management module.
nl_nl: Geen competentieschalen beschikbaar. U kunt schalen maken op de pagina "Competentieschalen" van de module Prestatiemanagement.

source: No skills available. You can upload skills in the "Skills library" page of the Performance Management module.
nl_nl: Geen vaardigheden beschikbaar. U kunt vaardigheden uploaden op de pagina "Vaardighedenbibliotheek" van de module Prestatiemanagement.

source: Edit skills & competency group
nl_nl: Bewerk vaardigheden- en competentiegroep

source: Select skills to add to the group
nl_nl: Selecteer vaardigheden om aan de groep toe te voegen

source: Categories
nl_nl: Categorieën

source: Skills
nl_nl: Vaardigheden

source: Categories: {{count}}
nl_nl: Categorieën: {{count}}

source: Scale:
nl_nl: Schaal:

source: Skills selected: {{count}}
nl_nl: Geselecteerde vaardigheden: {{count}}

source: Skills: {{count}}
nl_nl: Vaardigheden: {{count}}

source: Goal Management
nl_nl: Doelbeheer

source: Precision and flexibility with goal plans. Set fixed or recurring dates. Integrate with goal types, and assign your entire organization or specific populations.
nl_nl: Precisie en flexibiliteit met doelplannen. Stel vaste of terugkerende data in. Integreer met doeltypen en wijs je hele organisatie of specifieke groepen toe.

source: Craft personalized tags visible in goals. Workers can easily select fitting tags that refine the focus of their goals and foster clear direction in their pursuits.
nl_nl: Maak gepersonaliseerde tags zichtbaar in doelen. Werknemers kunnen eenvoudig passende tags selecteren die de focus van hun doelen verfijnen en een duidelijke richting in hun streven bevorderen.

source: Goals made simple with goal types. Set individual or organizational goals, and target your entire company or specific populations.
nl_nl: Doelen vereenvoudigd door doeltypen. Stel individuele of organisatorische doelen en richt je op je hele bedrijf of op specifieke groepen.

source: Define assignment permissions
nl_nl: Definieer toewijzingsrechten

source: Select the elements and features enabled in the review
nl_nl: Selecteer de elementen en functies die zijn ingeschakeld in de beoordeling

source: Review form components
nl_nl: Formulieronderdelen voor beoordeling

source: Enter the basic information for the review
nl_nl: Voer de basisinformatie voor de beoordeling in

source: Build your own questions and fields
nl_nl: Stel je eigen vragen en velden op

source: Section weights can be set up only when goals are enabled for this review template or when custom sections are created.
nl_nl: Sectiegewichten kunnen alleen worden ingesteld wanneer doelen zijn ingeschakeld voor deze beoordelingssjabloon of wanneer aangepaste secties zijn gemaakt.

source: Review and adjust weights to ensure they total 100%.
nl_nl: Controleer en pas gewichten aan om ervoor te zorgen dat ze in totaal 100% bedragen.

source: TOTAL
nl_nl: TOTAAL

source: The weight cannot exceed 100%.
nl_nl: Het gewicht mag niet hoger zijn dan 100%.

source: The weight must be at least 0%.
nl_nl: Het gewicht moet minimaal 0% zijn.

source: Section weights
nl_nl: Sectiegewichten

source: Review stages will contain a prepopulated set of stages, with only one step: Manager review.
nl_nl: Beoordelingsfasen bevatten een vooraf ingevulde set fasen, met slechts één stap: Managerbeoordeling.

source: Goal setting template
nl_nl: Sjabloon voor doelstellingen

source: Score calculation
nl_nl: Scoreberekening

source: The detailed configuration will be defined in the final step of review creation.
nl_nl: De gedetailleerde configuratie wordt vastgesteld in de laatste stap van het aanmaken van de review.

source: Enable total score calculation
nl_nl: Totaalscore berekening inschakelen

source: Define the participants to the review
nl_nl: Definieer de deelnemers van de evaluatie

source: Specify the review assignment permissions
nl_nl: Specificeer de machtigingen voor de beoordelingsopdracht

source: Review stages
nl_nl: Beoordelingsfasen

source: The detailed configuration will be defined in the final step of the review creation.
nl_nl: De gedetailleerde configuratie wordt gedefinieerd in de laatste stap van het aanmaken van de beoordeling.

source: The review process was successfully closed.
nl_nl: Het beoordelingsproces is succesvol afgesloten.

source: The review template was successfully deleted.
nl_nl: Het beoordelingssjabloon is succesvol verwijderd.

source: Primary owners can edit the population (based on creator's access).
nl_nl: Primaire eigenaren kunnen de populatie bewerken (gebaseerd op de toegang van de maker).

source: Before proceeding, please select an item to customize your review form.
nl_nl: Voordat u verder gaat, selecteer een item om uw beoordelingsformulier aan te passen.

source: Please fill in all mandatory fields.
nl_nl: Vul alle verplichte velden in.

source: To complete the process, all required information must first be provided by the owner.
nl_nl: Om het proces te voltooien, moet eerst alle vereiste informatie door de eigenaar worden verstrekt.

source: This template is currently in progress.
nl_nl: Deze sjabloon is momenteel in bewerking.

source: Select the rating scale in the menu.
nl_nl: Selecteer de beoordelingsschaal in het menu.

source: The review process was successfully reopened.
nl_nl: Het beoordelingsproces is succesvol heropend.

source: All your changes were saved as draft.
nl_nl: Al je wijzigingen zijn als concept opgeslagen.

source: Skill & Competency Groups
nl_nl: Vaardigheids- en competentiegroepen

source: Select at least one skill to proceed.
nl_nl: Selecteer ten minste één vaardigheid om door te gaan.

source: No skills added yet. Upload your company's skills library to start tracking, developing, and optimizing your team's talents.
nl_nl: Nog geen vaardigheden toegevoegd. Upload de vaardighedenbibliotheek van uw bedrijf om te beginnen met het volgen, ontwikkelen en optimaliseren van de talenten van uw team.

source: Manage your company's skills
nl_nl: Beheer de vaardigheden van uw bedrijf

source: Expand all
nl_nl: Alles uitvouwen

source: Collapse all
nl_nl: Alles inklappen

source: Current manager
nl_nl: Huidige leidinggevende

source: You’re about to reassign the manager for this career development plan. The new manager will gain all permissions and actions currently available to the existing manager.
nl_nl: U staat op het punt de manager van dit loopbaanontwikkelingsplan te wijzigen. De nieuwe manager krijgt alle rechten en acties die nu beschikbaar zijn voor de huidige manager.

source: New manager
nl_nl: Nieuwe manager

source: Search for a manager
nl_nl: Zoek een manager

source: The new manager cannot be empty.
nl_nl: De nieuwe manager mag niet leeg zijn.

source: Reassign
nl_nl: Opnieuw toewijzen

source: Reassign manager
nl_nl: Manager opnieuw toewijzen

source: This team member has no check-ins yet. Help start their journey by creating their first check-in.
nl_nl: Dit teamlid heeft nog geen check-ins. Help hun reis te beginnen door hun eerste check-in aan te maken.

source: This team member has no goals yet. Create goals to help them progress.
nl_nl: Dit teamlid heeft nog geen doelen. Maak doelen aan om hen te helpen vooruitgang te boeken.

source: Enhance this team member's profile by adding & rating skills
nl_nl: Verbeter het profiel van dit teamlid door vaardigheden toe te voegen en te beoordelen

source: Attached files
nl_nl: Bijgevoegde bestanden

source: Upload supporting files for the career development.
nl_nl: Upload ondersteunende bestanden voor de loopbaanontwikkeling.

source: Preview goals in the career development page.
nl_nl: Bekijk doelen op de pagina voor loopbaanontwikkeling.

source: You don’t have the necessary permissions to manage goal plans.
nl_nl: U heeft niet de benodigde rechten om doelplannen te beheren.

source: Please contact your system administrator for assistance.
nl_nl: Neem contact op met uw systeembeheerder voor hulp.

source: Select goal plan
nl_nl: Selecteer doelplan

source: Select goal type
nl_nl: Selecteer doeltype

source: Go to the career plan questionnaire step to make changes.
nl_nl: Ga naar de stap van de vragenlijst voor het carrièreplan om wijzigingen aan te brengen.

source: All skills from the library
nl_nl: Alle vaardigheden uit de bibliotheek

source: Define the source for skills and competency scales.
nl_nl: Definieer de bron voor vaardigheden- en competentieschalen.

source: Select skills & competency groups
nl_nl: Selecteer vaardigheden- en competentiegroepen

source: Choose one option
nl_nl: Kies een optie

source: Selected skills & competency groups
nl_nl: Geselecteerde vaardigheden en competentiegroepen

source: Select competency scale
nl_nl: Selecteer competentieschaal

source: Preview check-ins in the career development page.
nl_nl: Bekijk check-ins op de pagina voor loopbaanontwikkeling.

source: You must enable at least one widget to move to the next step.
nl_nl: U moet ten minste één widget inschakelen om naar de volgende stap te gaan.

source: Career plans
nl_nl: Carrièreplannen

source: Participants
nl_nl: Deelnemers

source: Reflect on your achievements, challenges, and career aspirations. Taking a moment to think about your experiences will help you clearly articulate your development goals.
nl_nl: Reflecteer op uw prestaties, uitdagingen en carrièreambities. Door even stil te staan bij uw ervaringen kunt u uw ontwikkelingsdoelen duidelijk verwoorden.

source: Identify both your short- and long-term career goals. Be specific about what you want to accomplish and the skills you’d like to develop. This will ensure the plan aligns with your personal and professional growth.
nl_nl: Identificeer zowel uw korte- als langetermijncarrièredoelen. Wees specifiek over wat u wilt bereiken en de vaardigheden die u wilt ontwikkelen. Dit zorgt ervoor dat het plan aansluit bij uw persoonlijke en professionele groei.

source: Think about the training, projects, or responsibilities that can help you achieve your goals. In your plan, include opportunities that will support your growth and career advancement.
nl_nl: Denk na over de training, projecten of verantwoordelijkheden die u kunnen helpen uw doelen te bereiken. Neem in uw plan kansen op die uw groei en carrièreontwikkeling zullen ondersteunen.

source: Break your goals down into actionable steps. Be sure to outline a timeline for achieving them and track your progress along the way.
nl_nl: Verdeel uw doelen in uitvoerbare stappen. Zorg ervoor dat u een tijdlijn opstelt voor het behalen ervan en volg uw voortgang onderweg.

source: Create a supportive environment where workers feel comfortable sharing their aspirations, challenges, and goals. Listen actively and ask thoughtful questions to better understand their vision.
nl_nl: Creëer een ondersteunende omgeving waarin medewerkers zich op hun gemak voelen om hun ambities, uitdagingen en doelen te delen. Luister actief en stel gerichte vragen om hun visie beter te begrijpen.

source: Take time to review the worker's career development plan in detail. Provide constructive feedback, acknowledge their strengths, and highlight areas for growth.
nl_nl: Neem de tijd om het loopbaanontwikkelingsplan van de medewerker in detail door te nemen. Geef constructieve feedback, erken hun sterke punten en belicht gebieden voor groei.

source: Encourage your reports to explore new challenges and opportunities that help them grow while building on their current strengths and skills.
nl_nl: Moedig uw medewerkers aan om nieuwe uitdagingen en kansen te verkennen die hen helpen groeien terwijl ze voortbouwen op hun huidige sterke punten en vaardigheden.

source: Share your own experiences and insights to inspire and guide workers. Be their advocate and actively support their growth journey.
nl_nl: Deel uw eigen ervaringen en inzichten om medewerkers te inspireren en te begeleiden. Wees hun pleitbezorger en ondersteun hun groeipad actief.

source: Prepare in advance
nl_nl: Bereid van tevoren voor

source: Define your goals
nl_nl: Definieer uw doelen

source: Explore development opportunities
nl_nl: Ontdek ontwikkelingsmogelijkheden

source: Set actionable steps
nl_nl: Stel uitvoerbare stappen in

source: Encourage open dialogue
nl_nl: Moedig open dialoog aan

source: Review the plan thoroughly
nl_nl: Bekijk het plan grondig

source: Suggest opportunities for growth
nl_nl: Groeimogelijkheden voorstellen

source: Be a mentor, not just a manager
nl_nl: Wees een mentor, niet alleen een manager

source: Here are some tips to guide you through filling out your career development plan:
nl_nl: Hier zijn enkele tips om u te begeleiden bij het invullen van uw loopbaanontwikkelingsplan:

source: Foster meaningful career development conversations!
nl_nl: Bevorder betekenisvolle carrièreontwikkelingsgesprekken!

source: Here are tips to effectively guide workers in their career development plans:
nl_nl: Hier zijn tips om werknemers effectief te begeleiden bij hun loopbaanontwikkelingsplannen:

source: Career plans that your team members own.
nl_nl: Carrièreplannen die uw teamleden bezitten.

source: This worker currently has no career development plans
nl_nl: Deze medewerker heeft momenteel geen loopbaanontwikkelingsplannen

source: Are you sure you want to reassign this career development plan to the selected manager?
nl_nl: Weet u zeker dat u dit loopbaanontwikkelingsplan wilt toewijzen aan de geselecteerde manager?

source: Confirm reassignment
nl_nl: Herindeling bevestigen

source: The career development plan was successfully reassigned.
nl_nl: Het loopbaanontwikkelingsplan is succesvol opnieuw toegewezen.

source: {{count}}/{{limit}} characters
nl_nl: {{count}}/{{limit}} tekens

source: The text exceeds the character limit.
nl_nl: De tekst overschrijdt de limiet van het aantal tekens.

source: Once your manager submits their view on your performance, you will be invited to either accept and complete the check-in, or request to meet for further discussion.
nl_nl: Zodra je manager een mening over je prestaties heeft ingediend, word je uitgenodigd om het check-in te accepteren en te voltooien, of om een verzoek in te dienen voor een verdere bespreking.

source: Set date
nl_nl: Datum instellen

source: Add discussion point
nl_nl: Voeg discussiepunt toe

source: Add recurrence
nl_nl: Herhaling toevoegen

source: If yes, click the button and open the file once it has been downloaded to add this event to your calendar, and that of the other attendee.
nl_nl: Als dat zo is, klik dan op de knop en open het bestand zodra het is gedownload om dit evenement aan uw agenda toe te voegen, en die van de andere deelnemer.

source: Download invite
nl_nl: Uitnodiging downloaden

source: Do you want to add this check-in to your calendar?
nl_nl: Wilt u deze check-in aan uw agenda toevoegen?

source: Make your check-ins more effective by adding key discussion points and agenda items every week. Reflect on the past week and plan for the next week to help increase productivity and ensure you and your manager are aligned on important deliverables.
nl_nl: Maak je check-ins effectiever door elke week belangrijke discussiepunten en agendapunten toe te voegen. Reflecteer op de afgelopen week en plan voor de komende week om de productiviteit te verhogen en ervoor te zorgen dat jij en je manager op één lijn zitten wat betreft belangrijke deliverables.

source: Have a great check-in conversation!
nl_nl: We wensen je een goed check-in-gesprek.

source: Here are some tips to make the most of your check-ins.
nl_nl: Hier zijn enkele tips om het meeste uit je check-ins te halen.

source: Make sure you use your check-in time wisely. Coming prepared can greatly benefit the quality of the conversation and also impress your manager, as it demonstrates your focus on your goals and development.
nl_nl: Zorg ervoor dat je je check-in tijd verstandig gebruikt. Goed voorbereid komen kan de kwaliteit van het gesprek aanzienlijk verbeteren en ook indruk maken op je manager, omdat het je focus op je doelen en ontwikkeling aantoont.

source: The central focus of a check-in should be your current workload, and it should aim at ensuring that you and your manager are aligned on your projects and goals.
nl_nl: Het centrale punt van een check-in moet je huidige werklast zijn en het moet erop gericht zijn dat jij en je manager op één lijn zitten wat betreft je projecten en doelen.

source: To prepare for your check-in, take some notes about the main items you have been working on that week and any key points you want to discuss. It only takes five minutes, but it can significantly improve the quality of your conversation.
nl_nl: Om je voor te bereiden op je check-in kun je wat aantekeningen maken over de belangrijkste zaken waar je die week aan hebt gewerkt en eventuele belangrijke punten die je wilt bespreken. Het kost maar vijf minuten, maar het kan de kwaliteit van je gesprek aanzienlijk verbeteren.

source: All participants
nl_nl: Alle deelnemers

source: Assign check-in
nl_nl: Check-in toewijzen

source: Recognize behavior profile of:
nl_nl: Herken gedragsprofiel van:

source: Offer your team member insight into how you think they have progressed on their behaviors over this period.
nl_nl: Vertel je teamlid hoe je vindt dat ze zich in hun gedrag hebben ontwikkeld gedurende deze periode.

source: You have changed the type of the check-in. Please review the change with the check-in attendee.
nl_nl: U heeft het type van de check-in gewijzigd. Gelieve de wijziging te bespreken met de check-in deelnemer.

source: No messages yet
nl_nl: Nog geen berichten
